ServiceTrouverUnNotaire/web/wsdl/PublicationWebServicePortType.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.7-b01  svn-revision#${svn.Last.Changed.Rev}. -->
<definitions targetNamespace="http://webservice/" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://webservice/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://webservice/" schemaLocation="PublicationWebServicePortType_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="get">
    <part name="parameters" element="tns:get"/>
  </message>
  <message name="getResponse">
    <part name="parameters" element="tns:getResponse"/>
  </message>
  <portType name="PublicationWebService">
    <operation name="get">
      <input ns1:Action="http://webservice/PublicationWebService/getRequest" message="tns:get" xmlns:ns1="http://www.w3.org/2007/05/addressing/metadata"/>
      <output ns2:Action="http://webservice/PublicationWebService/getResponse" message="tns:getResponse" xmlns:ns2="http://www.w3.org/2007/05/addressing/metadata"/>
    </operation>
  </portType>
</definitions>

